Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray2d.Value
Get the value of the property

Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray2d
Represents a property consisting of an array of double values.
Remarks:
In virtually all cases, the array will contain exactly 2 values.